# Taps
tap "fluxcd/tap"
tap "hashicorp/tap"
tap "helm/tap"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "romkatv/powerlevel10k"

# Packages
brew "actionlint"
brew "antigen"
brew "argocd"
brew "bash-completion"
brew "bash-git-prompt"
brew "bcrypt"
brew "curl"
brew "direnv"
brew "exa"
brew "flux"
brew "gettext"
brew "gh"
brew "git"
brew "gpg"
brew "go"
brew "gpg"
brew "graphviz"
brew "hashicorp/tap/terraform"
brew "helm"
brew "jq"
brew "jsonnet"
brew "kind"
brew "kubectx"
brew "kubernetes-cli"
brew "kustomize"
brew "markdown"
brew "nmap"
brew "node"
brew "openjdk"
brew "openssl"
brew "pdm"
brew "pipenv"
brew "podman"
brew "podman-compose"
brew "prettier"
brew "pyenv"
brew "python3"
brew "readline"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "ruby"
brew "shellcheck"
brew "terraformer"
brew "tflint"
brew "thefuck"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "yamllint"
brew "yq"
brew "zsh"

# Apps
cask "alfred"
cask "bitwarden"
cask "caffeine"
cask "discord"
cask "figma"
cask "firefox"
cask "github"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "iterm2"
cask "keka"
cask "lens"
cask "little-snitch"
cask "miro"
cask "notion"
cask "plex"
cask "slack"
cask "signal"
cask "spotify"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"

# Fonts
cask "font-consolas-for-powerline"
cask "font-fira-code-nerd-font"
cask "font-fira-code"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-nerd-font"
cask "font-inconsolata"
cask "font-menlo-for-powerline"
cask "font-meslo-lg-dz"
cask "font-meslo-lg-nerd-font"
cask "font-meslo-lg"

# Quicklook
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlimagesize"
cask "quicklook-csv"
cask "quicklook-json"
