4ops.terraform
alefragnani.project-manager
bierner.markdown-mermaid
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
eamodio.gitlens
EditorConfig.EditorConfig
esbenp.prettier-vscode
GitHub.copilot
GitHub.copilot-chat
golang.go
hashicorp.terraform
humao.rest-client
kumar-harsh.graphql-for-vscode
mikestead.dotenv
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode.atom-keybindings
ms-vscode.makefile-tools
ms-vscode.sublime-keybindings
ninoseki.vscode-pylens
redhat.vscode-yaml
rust-lang.rust-analyzer
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
timonwong.shellcheck
yzhang.markdown-all-in-one
